In [37]:
import pandas as pd 
url = "https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv"

df_alumnos = pd.read_csv(url)
df_alumnos.head(20)

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero

In [38]:
# Verificar valores nulos
df_alumnos.isnull().sum()
df_alumnos = df_alumnos.fillna(0)

In [39]:
# Eliminar a Alicia y Carlos que ya no forman parte del grupo
# todo -> Primero generar el filtro
eliminar_alumnos = ['Alicia', 'Carlos']
alumnos_index = df_alumnos.query("@eliminar_alumnos in Nombre").index
# todo: Aplicar los filtros
# alumnos_index
df_alumnos.drop(alumnos_index, axis=0, inplace=True)
df_alumnos

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   0.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   0.0      False
6    Daniela    21   7.0       True
9     Victor    28   0.0      False
10    Danilo    21   0.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   0.0      False
15    Milena    29   7.0       True
16     Lucas    33   0.0      False
17     Nadia    34   8.0  Verdadero

In [40]:

# Seleccionar solo a los estudiantes que fueron aprovados
#indicamos el True como strin por que el tipo de dato no es boolean

filtro = df_alumnos['Aprobado'] == "True"
# filtro
df_alumnos_aprovados = df_alumnos[filtro]
df_alumnos_aprovados

      Nombre  Edad  Nota Aprobado
0    Alberto    20   7.5     True
4      Brian    21  10.0     True
6    Daniela    21   7.0     True
12  Stephany    26  10.0     True
13    Miriam    25   9.0     True
15    Milena    29   7.0     True

In [41]:
# guardar el data frame de los alumnos que fueron aprovados como alumnos_arpobados.csv
df_alumnos_aprovados.to_csv('./resources/alumnos_aprovados.csv')

In [42]:
# Los alumnos aprovados que obtuvieron una calificacion de 7 en realizadad tenian un punto extra que no se contabilizo
# por lo tanto reemplazar las calificaciones de 7 en la base de datos por 8

df_alumnos_aprovados = df_alumnos_aprovados.replace(7.0, 8.0)

## **AULA 4 DESAFIO**

In [43]:
datos = pd.read_csv(url)
datos.head()

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True

In [44]:
# Crear una columna llamada puntos extras que contenga sus puntos extras de cada 
# estudiante es decir el 40% de su nota actual

datos['Puntos_entras'] = datos['Nota'] * .4
datos.head()

    Nombre  Edad  Nota Aprobado  Puntos_entras
0  Alberto    20   7.5     True            3.0
1      Ana    18   NaN    False            NaN
2   Camila    27   2.5    False            1.0
3    David    18   5.0    False            2.0
4    Brian    21  10.0     True            4.0

In [45]:
# Crear otra columna llamada notas finales que contenga su nota actual mas los puntos extras
datos['Notas_finales'] = datos['Nota'] + datos['Puntos_entras']
datos.head()

    Nombre  Edad  Nota Aprobado  Puntos_entras  Notas_finales
0  Alberto    20   7.5     True            3.0           10.5
1      Ana    18   NaN    False            NaN            NaN
2   Camila    27   2.5    False            1.0            3.5
3    David    18   5.0    False            2.0            7.0
4    Brian    21  10.0     True            4.0           14.0

In [46]:
# Tomando en cuenta el cambio de las notas crear una columna llamada
# Aprobado_final con True si es mayor o igual a 7.0 y False si no

datos['Aprobado_final'] = datos['Notas_finales'].apply(lambda x: True if x >= 7.0 else False)

In [49]:
# Filtrar los alumnos que pasaron gracias a los puntos extras
seleccion = (datos['Aprobado'] == "False") & (datos['Aprobado_final'] == True)

# datos.head(20)
datos[seleccion]

   Nombre  Edad  Nota Aprobado  Puntos_entras  Notas_finales  Aprobado_final
3   David    18   5.0    False           2.00           7.00            True
7  Carlos    19   6.0    False           2.40           8.40            True
8  Alicia    35   5.6    False           2.24           7.84            True